## Production: s3
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                       |
|--------|---------------------------------------------------------------------------------|
| add    | `aws_s3_bucket.audit_logs_archive_storage`                                      |
|        | `aws_s3_bucket_lifecycle_configuration.audit_logs_archive_storage`              |
|        | `aws_s3_bucket_ownership_controls.audit_logs_archive_storage`                   |
|        | `aws_s3_bucket_public_access_block.audit_logs_archive_storage`                  |
|        | `aws_s3_bucket_server_side_encryption_configuration.audit_logs_archive_storage` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.audit_logs_archive_storage will be created
  + resource "aws_s3_bucket" "audit_logs_archive_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "forms-production-audit-logs-archive-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.audit_logs_archive_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "audit_logs_archive_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "Clear Audit Logs Archive Storage after 1 year and 11 months"
          + status = "Enabled"

          + expiration {
              + days                         = 700
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.audit_logs_archive_storage will be created
  + resource "aws_s3_bucket_ownership_controls" "audit_logs_archive_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_public_access_block.audit_logs_archive_storage will be created
  + resource "aws_s3_bucket_public_access_block" "audit_logs_archive_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.audit_logs_archive_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "audit_logs_archive_storage" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + audit_logs_archive_storage_arn = (known after apply)
  + audit_logs_archive_storage_id  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.archive_storage"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.audit_logs_archive_storage"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.lambda_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.reliability_file_storage"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.vault_file_storage"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
